# 효진이는 1칸/2칸 뛰기가 가능

# 칸 1개 : (1) => 1
# 칸 2개 : (1,1) (2) => 2
# 칸 3개 : (1,1,1) (1,2) (2,1) => 3
# 칸 4개 : (1,1,1,1) (1,1,2) (1,2,1) (2,1,1) (2,2) => 5
## n 번째 값 = (n-1)번째 값 + (n-2)번째 값
## => dp

def solution(n):
    """
    Args:
        n (int) : 멀리뛰기에 사용될 칸 수
    Returns:
        효진이가 끝에 도달하는 방법 수
    """
    dp = [0]*(n+1)
    
    if n <= 2:
        return n
    
    dp[1] = 1
    dp[2] = 2
    
    for i in range(3, n+1):
        dp[i] = (dp[i-1] + dp[i-2])
        
    return dp[n] % 1234567